gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
static nrf_spi_mngr_transfer_t dac_wrm_mode_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_wrm_mode, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_wtm_mode_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_wtm_mode, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_cmd_update_select_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_cmd_update_select, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_cmd_chan_a_write_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_cmd_chan_a_write, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_cmd_broadcast_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_cmd_broadcast, 2, NULL, 0) };

static uint16_t dac_reg_init[8] = { 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800 };
static uint16_t dac_reg_pulse[8] = { 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800 };
static uint16_t dac_reg_recycle[8] = { 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800 };

// this function update 8 channels simultaneously
// there are two ways to do so
// 1. set wrm mode, update 8 channels, special command 1
// 2. set wrm mode, update 7 channles, special command 2
// here we use the second method.
#ifdef DAC_SPI_USE_MNGR
static void dac_update_simult(uint16_t data[8])
{
    (void)dac_wrm_mode;
    (void)dac_wtm_mode;
    (void)dac_cmd_update_select;
    (void)dac_cmd_chan_a_write;
    (void)dac_wrm_mode_xfer;
    (void)dac_wtm_mode_xfer;
    (void)dac_cmd_update_select_xfer;
    (void)dac_cmd_chan_a_write_xfer;
    (void)dac_reg_init;
    (void)dac_reg_pulse;
    (void)dac_reg_recycle;
    (void)dac_update_simult;

    set_dac_update_mode(DAC_WRM_MODE);

    uint16_t cha = data[0] | 0xb000;
    nrf_spi_mngr_transfer_t xfers[] =
    {
        NRF_SPI_MNGR_TRANSFER(&data[1], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[2], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[3], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[4], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[5], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[6], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[7], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&cha,     2, NULL, 0)
    };

//    nrf_spi_mngr_transaction_t trans =
//    {
//        .begin_callback = NULL,
//        .end_callback = NULL,
//        .p_user_data = NULL,
//        .p_transfers = xfers,
//        .number_of_transfers = sizeof(xfers) / sizeof(xfers[0]),
//        .p_required_spi_cfg = NULL,
//    };

    nrf_spi_mngr_perform(&m_dac_spi_mngr, &m_dac_spi_config, xfers, sizeof(xfers) / sizeof(xfers[0]), NULL);
//    nrf_spi_mngr_schedule(&m_dac_spi_mngr, &trans);
}
#endif

#ifdef DAC_USE_SPI_MNGR
static void dac_update_pulse()
{
    uint32_t err_code;
    set_dac_update_mode(DAC_WRM_MODE);

    static nrf_spi_mngr_transfer_t xfers[] =
    {
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[0], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[1], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[2], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[3], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[4], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[5], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[6], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_reg_pulse[7], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&dac_cmd_update_all, 2, NULL, 0),
    };

    static nrf_spi_mngr_transaction_t trans =
    {
        .begin_callback = NULL,
        .end_callback = NULL,
        .p_user_data = NULL,
        .p_transfers = xfers,
        .number_of_transfers = sizeof(xfers) / sizeof(xfers[0]),
        .p_required_spi_cfg = NULL,
    };

    err_code = nrf_spi_mngr_schedule(&m_dac_spi_mngr, &trans);
    APP_ERROR_CHECK(err_code);
}
#endif

static void dac_update_recycle()
{

}

#ifdef DAC_USE_SPI_MNGR
static void dac_update_sequent(uint16_t data[8])
{
    (void)dac_update_sequent;

    set_dac_update_mode(DAC_WTM_MODE);

    nrf_spi_mngr_transfer_t xfers[] =
    {
        NRF_SPI_MNGR_TRANSFER(&data[0], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[1], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[2], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[3], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[4], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[5], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[6], 2, NULL, 0),
        NRF_SPI_MNGR_TRANSFER(&data[7], 2, NULL, 0)
    };

    nrf_spi_mngr_perform(&m_dac_spi_mngr, &m_dac_spi_config, xfers, sizeof(xfers) / sizeof(xfers[0]), NULL);
}
#endif

#ifdef DAC_USE_SPI_MNGR
static void dac_update_same(uint8_t val)
{
    (void)dac_update_same;

    uint16_t data = (((uint16_t)val) << 4) | 0xC000;

    nrf_spi_mngr_transfer_t xfers[] =
    {
        NRF_SPI_MNGR_TRANSFER(&data, 2, NULL, 0),
    };

    nrf_spi_mngr_perform(&m_dac_spi_mngr, &m_dac_spi_config, xfers, sizeof(xfers) / sizeof(xfers[0]), NULL);
}
#endif

/***
 * SPI and Analog Switch
 *
 * hardware signal mapping
 * A -> S6 (1 << 5) 0x20
 * B -> S5 (1 << 4) 0x10
 * C -> S4 (1 << 3) 0x08
 * D -> S3 (1 << 2) 0x04
 * E -> S8 (1 << 7) 0x80
 * F -> S7 (1 << 6) 0x40
 * G -> S2 (1 << 1) 0x02
 * H -> S1 (1 << 0) 0x01
 */

// spi manager
// NRF_SPI_MNGR_DEF(m_asw_spi_mngr, 16, ASW_SPI_ID);

// spi config
static nrf_drv_spi_config_t const m_asw_spi_config =
{
    .sck_pin        = 6,                            // P0.06 SW_CLK_A
    .mosi_pin       = 8,                            // P0.08 SW_DIN_A
    .miso_pin       = NRF_DRV_SPI_PIN_NOT_USED,
    .ss_pin         = 5,                            // P0.05 SW_SYNC_A
    .irq_priority   = APP_IRQ_PRIORITY_LOWEST,
    .orc            = 0xFF,
    .frequency      = NRF_DRV_SPI_FREQ_8M,
    .mode           = NRF_DRV_SPI_MODE_2,           // CPOL = 1, CLK idle high
                                                    // CPHA = 0, data sampled on falling edge
                                                    // see adg1414.pdf, figure 2, also serial peripheral interface on wiki
    .bit_order      = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST
};

//static void asw_on(void)
//{
//    const static uint8_t mask[8] = { 1 << 5, 1 << 4, 1 << 3, 1 << 2, 1 << 7, 1 << 6, 1 << 1, 1 << 0 };
//    uint8_t cfg = 0;

