gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
//    cfg |= m_msg.current[0] ? mask[0] : 0;    // A
//    cfg |= m_msg.current[1] ? mask[1] : 0;    // B
//    cfg |= m_msg.current[2] ? mask[2] : 0;    // C
//    cfg |= m_msg.current[3] ? mask[3] : 0;    // D
//    cfg |= m_msg.current[4] ? mask[4] : 0;    // E
//    cfg |= m_msg.current[5] ? mask[5] : 0;    // F
//    cfg |= m_msg.current[6] ? mask[6] : 0;    // G
//    cfg |= m_msg.current[7] ? mask[7] : 0;    // H

//    nrf_spi_mngr_transfer_t xfers[] =
//    {
//        NRF_SPI_MNGR_TRANSFER(&cfg, 1, NULL, 0),
//    };

//    nrf_spi_mngr_perform(&m_asw_spi_mngr, NULL, xfers, sizeof(xfers) / sizeof(xfers[0]), NULL);
//}

//static void asw_off(void)
//{
//    uint8_t cfg = 0;

//    nrf_spi_mngr_transfer_t xfers[] =
//    {
//        NRF_SPI_MNGR_TRANSFER(&cfg, 1, NULL, 0),
//    };

//    nrf_spi_mngr_perform(&m_asw_spi_mngr, NULL, xfers, sizeof(xfers) / sizeof(xfers[0]), NULL);
//}

/**
 * Timer
 */
const nrf_drv_timer_t m_count_timer = NRF_DRV_TIMER_INSTANCE(COUNT_TIMER_ID);
const nrf_drv_timer_t m_cycle_timer = NRF_DRV_TIMER_INSTANCE(CYCLE_TIMER_ID);
const nrf_drv_timer_t m_burst_timer = NRF_DRV_TIMER_INSTANCE(BURST_TIMER_ID);

static void test1_burst_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("burst channel 0 fired");
            break;
        default:
            break;
    }
}

static void test1_cycle_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("cycle channel 0 fired");
            break;
        default:
            break;
    }
}


static void test1_timer_init(void)
{
    uint32_t err_code;
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&m_cycle_timer, &timer_cfg, test1_cycle_timer_callback);  // TODO
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_timer_init(&m_burst_timer, &timer_cfg, test1_burst_timer_callback);  // TODO
    APP_ERROR_CHECK(err_code);
}

/**
 *  In test1, cycle timer fires once. Both ppi and interrupt handler are configured.
 *  ppi start burst timer, which also fires once, printing something in interrupt handler. (print once, not periodically)
 *  We expect both prints work, indicating that ppi and interrupt handler could work simultaneously.
 */
static void test1_run(void)
{
    (void)test1_run;
    nrfx_err_t err;
    nrf_ppi_channel_t ppi_channel;

    test1_timer_init();

    nrf_drv_timer_extended_compare(&m_cycle_timer,
                                   NRF_TIMER_CC_CHANNEL0,
                                   3 * 1000 * 1000,
                                   NRF_TIMER_SHORT_COMPARE0_STOP_MASK, true);

    nrf_drv_timer_extended_compare(&m_burst_timer,
                                   NRF_TIMER_CC_CHANNEL0,
                                   3 * 1000 * 1000,
                                   NRF_TIMER_SHORT_COMPARE0_STOP_MASK, true);

    err = nrfx_ppi_channel_alloc(&ppi_channel);
    APP_ERROR_CHECK(err);

    uint32_t cycle_timer_event_address = nrfx_timer_compare_event_address_get(&m_cycle_timer, NRF_TIMER_CC_CHANNEL0);
    uint32_t burst_timer_task_address = nrfx_timer_task_address_get(&m_burst_timer, NRF_TIMER_TASK_START);

    err = nrfx_ppi_channel_assign(ppi_channel, cycle_timer_event_address, burst_timer_task_address);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_enable(&m_cycle_timer);
    NRF_LOG_INFO("test1 started");
}

static void test2_count_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("count 0");
            break;
        default:
            break;
    }
}

static void test2_burst_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("burst 0 -");
            break;
        default:
            NRF_LOG_INFO("burst fired");
            break;
    }
}

static void test2_cycle_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("cycle 0 +");
            nrf_drv_timer_clear(&m_burst_timer);
            break;
        case NRF_TIMER_EVENT_COMPARE1:
            NRF_LOG_INFO("cycle channel 1 fired");
            break;
        default:
            break;
    }
}

static void test2_timer_init(void)
{
    uint32_t err_code;

    nrf_drv_timer_config_t count_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    count_cfg.mode = (nrf_timer_mode_t)1;   // 1 for counter mode,
    err_code = nrf_drv_timer_init(&m_count_timer, &count_cfg, test2_count_timer_callback);
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&m_cycle_timer, &timer_cfg, test2_cycle_timer_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_timer_init(&m_burst_timer, &timer_cfg, test2_burst_timer_callback);
    APP_ERROR_CHECK(err_code);
}

/**
 * In test2, the lifespan of cycle timer contains five cycle or burst timer.
 *
 * burst timer is one-shot, log a number in interrupt.
 * cycle timer compares to 1s, ppi to increment counter and to start burst timer as well.
 * counter set to compare 5.
 *
 */
static void test2_run(void)
{
    (void)test2_run;
    nrfx_err_t err;

    test2_timer_init();

    // count timer channel 0 count to 5
    nrf_drv_timer_extended_compare(&m_count_timer, NRF_TIMER_CC_CHANNEL0, 5, NRF_TIMER_SHORT_COMPARE0_STOP_MASK, true);

    // short-lived one-shot, print in isr, triggered by cycle timer
    nrf_drv_timer_extended_compare(&m_burst_timer, NRF_TIMER_CC_CHANNEL0, 50, NRF_TIMER_SHORT_COMPARE0_STOP_MASK, true);
    // nrf_drv_timer_compare(&m_burst_timer, NRF_TIMER_CC_CHANNEL0, 1000, true);
    // nrf_drv_timer_enable(&m_burst_timer);

    // cycle timer repeats in seconds.
    nrf_drv_timer_extended_compare(&m_cycle_timer, NRF_TIMER_CC_CHANNEL0, 2 * 1000 * 1000, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    // cycle start burst
    nrf_ppi_channel_t cycle_start_burst;
    err = nrfx_ppi_channel_alloc(&cycle_start_burst);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_assign(cycle_start_burst,
                                  nrfx_timer_compare_event_address_get(&m_cycle_timer, NRF_TIMER_CC_CHANNEL0),
                                  nrfx_timer_task_address_get(&m_burst_timer, NRF_TIMER_TASK_START));
    APP_ERROR_CHECK(err);

