gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
    err = nrfx_ppi_channel_enable(cycle_start_burst);
    APP_ERROR_CHECK(err);

    // cycle increment count
    nrf_ppi_channel_t cycle_increment_count;
    err = nrfx_ppi_channel_alloc(&cycle_increment_count);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_assign(cycle_increment_count,
                                  nrfx_timer_compare_event_address_get(&m_cycle_timer, NRF_TIMER_CC_CHANNEL0),
                                  nrfx_timer_task_address_get(&m_count_timer, NRF_TIMER_TASK_COUNT));
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(cycle_increment_count);
    APP_ERROR_CHECK(err);

    // count stop cycle
    nrf_ppi_channel_t count_stop_cycle;
    err = nrfx_ppi_channel_alloc(&count_stop_cycle);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_assign(count_stop_cycle,
                                  nrfx_timer_compare_event_address_get(&m_count_timer, NRF_TIMER_CC_CHANNEL0),
                                  nrfx_timer_task_address_get(&m_cycle_timer, NRF_TIMER_TASK_STOP));
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(count_stop_cycle);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_enable(&m_count_timer);
    nrf_drv_timer_enable(&m_cycle_timer);

    NRF_LOG_INFO("test2 started 2");
}

static void burst_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
}

#ifdef DAC_USE_SPI_MNGR
static void cycle_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("channel 0 fired");
            dac_update_pulse();
            // NRF_LOG_INFO("inside isr %d", INSIDE_ISR);
            break;
        case NRF_TIMER_EVENT_COMPARE1:
            NRF_LOG_INFO("channel 1 fired");
            // dac_update_simult(dac_reg_recycle);
            break;
        case NRF_TIMER_EVENT_COMPARE2:  // won't fire
            NRF_LOG_INFO("channel 2 fired");
            break;
        default:
            break;
    }
}
#endif

#ifndef DAC_USE_SPI_MNGR

static void test4_run(void)
{
    (void)test4_run;

    NRF_LOG_INFO("test04, power down all but H (VOUTD,PORTD), toggle VOUTD (TP7)");

    static uint8_t pd[2] = { 0xD0, 0x3F };  // power down all but h
    static uint8_t wt[2] = { 0x90, 0x00 };  // set wtm mode
    static uint8_t hh[2] = { 0x78, 0x00 };  // set channel h high
    static uint8_t hl[2] = { 0x70, 0x00 };  // set channel h low

    nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, NULL, NULL);
    nrf_drv_spi_transfer(&m_dac_spi, pd, 2, NULL, 0);
    nrf_drv_spi_transfer(&m_dac_spi, wt, 2, NULL, 0);

    for (;;)
    {
        nrf_drv_spi_transfer(&m_dac_spi, hh, 2, NULL, 0);
        vTaskDelay(512);
        nrf_drv_spi_transfer(&m_dac_spi, hl, 2, NULL, 0);
        vTaskDelay(512);
    }
}

static void test5_run(void)
{
    (void)test5_run;

    NRF_LOG_INFO("test 5, power down all but G (VOUTC,PORTC) and toggle");
    NRF_LOG_INFO("  VOUTC (TP9) should toggle");

    static uint8_t pd[2] = { 0xD0, 0xBF };  // power down all but g
    static uint8_t wt[2] = { 0x90, 0x00 };  // set wtm mode
    static uint8_t gh[2] = { 0x68, 0x00 };  // set channel g high
    static uint8_t gl[2] = { 0x60, 0x00 };  // set channel g low

    nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, NULL, NULL);
    nrf_drv_spi_transfer(&m_dac_spi, pd, 2, NULL, 0);
    nrf_drv_spi_transfer(&m_dac_spi, wt, 2, NULL, 0);

    for (;;)
    {
        nrf_drv_spi_transfer(&m_dac_spi, gh, 2, NULL, 0);
        vTaskDelay(512);
        nrf_drv_spi_transfer(&m_dac_spi, gl, 2, NULL, 0);
        vTaskDelay(512);
    }
}

static void test6_run(void)
{
    (void)test6_run;

    NRF_LOG_INFO("test 6, short VOUTD (H) and VMID (2.5V), toggle G (VOUTC - TP9, PORTC)");

    static uint8_t pd[2] = { 0xD0, 0x3F };  // power down all but g and h
    static uint8_t wt[2] = { 0x90, 0x00 };  // set wtm mode
    static uint8_t hm[2] = { 0x78, 0x00 };  // set channel h to half
    static uint8_t gh[2] = { 0x6E, 0xB0 };  // set channel g high
    static uint8_t gl[2] = { 0x61, 0x00 };  // set channel g low

    nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, NULL, NULL);
    nrf_drv_spi_transfer(&m_dac_spi, pd, 2, NULL, 0);
    nrf_drv_spi_transfer(&m_dac_spi, wt, 2, NULL, 0);
    nrf_drv_spi_transfer(&m_dac_spi, hm, 2, NULL, 0);

    for (;;)
    {
        nrf_drv_spi_transfer(&m_dac_spi, gh, 2, NULL, 0);
        vTaskDelay(512);
        nrf_drv_spi_transfer(&m_dac_spi, gl, 2, NULL, 0);
        vTaskDelay(512);
    }
}

static void test7_burst_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    NRF_LOG_INFO("test7 burst timer cb");
}

static void test7_spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context)
{
    NRF_LOG_INFO("test 7 spi evt handler");
}

/**
 * test7 tries to repeatedly start spi (hold) xfer by ppi. Also, ss signal triggered by the SAME event source.
 *
 * burst timer compare0 is used as event source, triggering ss toggle (cs low), as well as spi task using fork.
 * spi end triggers the other ss toggle (cs high) in the same cycle.
 * burst timer also has a rewind (compare1) for repetition.
 *
 * a dummy write (wtm) used as spi xfer data. no verified. ss signal and spi clock are verified as expected on
 * oscilloscope.
 */
static void test7_run(void)
{
    (void)test7_run;

    uint32_t err, event_addr, task_addr;

    // gpio init ss pin
    err = nrfx_gpiote_init();
    APP_ERROR_CHECK(err);

    nrfx_gpiote_out_config_t ss_pin_config = NRFX_GPIOTE_CONFIG_OUT_TASK_TOGGLE(true); // task pin, initial high
    err = nrfx_gpiote_out_init(DAC_SPI_SS_PIN, &ss_pin_config);
    APP_ERROR_CHECK(err);

    nrfx_gpiote_out_task_enable(DAC_SPI_SS_PIN);

    // spi init
    static dac_spi_ctx_t ctx = { 0 };
    err = nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, test7_spi_event_handler, &ctx);
    APP_ERROR_CHECK(err);

    // timer init
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err = nrf_drv_timer_init(&m_burst_timer, &timer_cfg, test7_burst_timer_callback);
    APP_ERROR_CHECK(err);

