gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
    // trigger
    nrf_drv_timer_compare(&m_burst_timer,
                          NRF_TIMER_CC_CHANNEL0,
                          1000 * 1000, // 100,
                          true);
    // rewind, 100Hz
    nrf_drv_timer_extended_compare(&m_burst_timer,
                                   NRF_TIMER_CC_CHANNEL1,
                                   3000 * 1000, // 10 * 1000,
                                   NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK,
                                   false);
    // ppis
    nrf_ppi_channel_t ppic_timc0;
    nrf_ppi_channel_t ppic_spi_end;

    // timer trigger ss
    err = nrfx_ppi_channel_alloc(&ppic_timc0);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_burst_timer, NRF_TIMER_CC_CHANNEL0);
    task_addr = nrfx_gpiote_out_task_addr_get(DAC_SPI_SS_PIN);

    err = nrfx_ppi_channel_assign(ppic_timc0, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    task_addr = nrf_drv_spi_start_task_get(&m_dac_spi);
    err = nrfx_ppi_channel_fork_assign(ppic_timc0, task_addr);

    err = nrfx_ppi_channel_enable(ppic_timc0);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_alloc(&ppic_spi_end);
    APP_ERROR_CHECK(err);

    event_addr = nrf_drv_spi_end_event_get(&m_dac_spi);
    task_addr = nrfx_gpiote_out_task_addr_get(DAC_SPI_SS_PIN);

    err = nrfx_ppi_channel_assign(ppic_spi_end, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppic_spi_end);
    APP_ERROR_CHECK(err);

    // spi start
    static uint8_t wt[2] = { 0x90, 0x00 }; // set wtm mode
    static nrf_drv_spi_xfer_desc_t xfer = {
        .p_tx_buffer = wt,
        .tx_length = 2
    };

    uint32_t flags =
        NRF_DRV_SPI_FLAG_HOLD_XFER |
        // NRF_DRV_SPI_FLAG_RX_POSTINC |
        // NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER |
        NRF_DRV_SPI_FLAG_REPEATED_XFER;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, flags);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_enable(&m_burst_timer);
}

static void test8_burst_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    // NRF_LOG_INFO("test8 burst timer cb");
}

static void test8_count_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    NRF_LOG_INFO("test8 count timer cb");
}

static void test8_spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context)
{
    // NRF_LOG_INFO("test8 spi evt handler");
}


/**
 * test7 tries to repeatedly start spi (hold) xfer by ppi. Also, ss signal triggered by the SAME event source.
 *
 * burst timer compare0 is used as event source, triggering ss toggle (cs low), as well as spi task using fork.
 * spi end triggers the other ss toggle (cs high) in the same cycle.
 * burst timer also has a rewind (compare1) for repetition.
 *
 * a dummy write (wtm) used as spi xfer data. no verified. ss signal and spi clock are verified as expected on
 * oscilloscope.

 * test8 adds a count timer, counts up to N (=8), insisting on cs low in the beginning and cs high in the end (
 * aka. cs normally high).
 *
 * which signal should be used for cs high in each cycle? test8a uses spi end event. This leaves a wide gap
 * between spi clk/data end and spi high. the minimal cycle is 49. for 8 words this translates into 24.5uS. Or
 * for better safety, use 50 (25uS)
 *
 * burst timer c0 starts spi. c1 for cs low, as well as counting.
 * count timer c0 is oneshot and stops burst timer.
 * count timer is started manually. no trigger.
 * spi-end triggers all cs high.
 *
 * if this two timers work together as an inside loop. there should be a (repeated) trigger in outside loop to
 * start both. supposedly. This should be verified in next test.

 * alternatively. use burst timer c2 (rewind) to trigger cs high and to count, in this case c0 must be at least 4.
 */
static void test8a_run(void)
{
    (void)test7_run;

    uint32_t err, event_addr, task_addr;

    // gpio init ss pin
    err = nrfx_gpiote_init();
    APP_ERROR_CHECK(err);

    nrfx_gpiote_out_config_t ss_pin_config = NRFX_GPIOTE_CONFIG_OUT_TASK_TOGGLE(true); // task pin, initial high
    err = nrfx_gpiote_out_init(DAC_SPI_SS_PIN, &ss_pin_config);
    APP_ERROR_CHECK(err);

    nrfx_gpiote_out_task_enable(DAC_SPI_SS_PIN);

    // spi reinit
    static dac_spi_ctx_t ctx = { 0 };
    err = nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, test8_spi_event_handler, &ctx);
    APP_ERROR_CHECK(err);

    // burst timer init
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_16MHz;
    err = nrf_drv_timer_init(&m_burst_timer, &timer_cfg, test8_burst_timer_callback); // TODO remove cb?
    APP_ERROR_CHECK(err);

    // trigger spi
    nrf_drv_timer_compare(&m_burst_timer,
                          NRF_TIMER_CC_CHANNEL0,
                          1, // 100,
                          false);

    // trigger ss
    nrf_drv_timer_compare(&m_burst_timer,
                          NRF_TIMER_CC_CHANNEL1,
                          7, // 100,
                          false);
    // rewind, 100Hz
    nrf_drv_timer_extended_compare(&m_burst_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   50, // 10 * 1000,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   false);

    // count timer init
    nrf_drv_timer_config_t count_cfg =
    {
        .frequency          = (nrf_timer_frequency_t)NRF_TIMER_FREQ_16MHz,
        .bit_width          = (nrf_timer_bit_width_t)NRFX_TIMER_DEFAULT_CONFIG_BIT_WIDTH, // sufficient large for test
        .mode               = (nrf_timer_mode_t)1,
        .interrupt_priority = NRFX_TIMER_DEFAULT_CONFIG_IRQ_PRIORITY,
    };

    err = nrf_drv_timer_init(&m_count_timer, &count_cfg, test8_count_timer_callback);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_extended_compare(&m_count_timer,
                                   NRF_TIMER_CC_CHANNEL0,
                                   2,
                                   NRF_TIMER_SHORT_COMPARE0_STOP_MASK,
                                   true);

