gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
    // ppis
    nrf_ppi_channel_t ppic_timc0;   // starts spi and count
    nrf_ppi_channel_t ppic_timc1;   // assert ss
    // nrf_ppi_channel_t ppic_timc2;   // replace ppic_spi_end
    nrf_ppi_channel_t ppic_cntc0;
    nrf_ppi_channel_t ppic_spi_end;

    // timc0 trigger spi
    err = nrfx_ppi_channel_alloc(&ppic_timc0);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_burst_timer, NRF_TIMER_CC_CHANNEL0);
    task_addr = nrf_drv_spi_start_task_get(&m_dac_spi);

    err = nrfx_ppi_channel_assign(ppic_timc0, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    // as well as count
//    task_addr = nrfx_timer_task_address_get(&m_count_timer, NRF_TIMER_TASK_COUNT);
//    err = nrfx_ppi_channel_fork_assign(ppic_timc0, task_addr);
//    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppic_timc0);
    APP_ERROR_CHECK(err);

    // timc1 triggers ss, and counting
    err = nrfx_ppi_channel_alloc(&ppic_timc1);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_burst_timer, NRF_TIMER_CC_CHANNEL1);
    task_addr = nrfx_gpiote_out_task_addr_get(DAC_SPI_SS_PIN);

    err = nrfx_ppi_channel_assign(ppic_timc1, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    task_addr = nrfx_timer_task_address_get(&m_count_timer, NRF_TIMER_TASK_COUNT);
    err = nrfx_ppi_channel_fork_assign(ppic_timc1, task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppic_timc1);
    APP_ERROR_CHECK(err);

    // cntc0 stops burst timer
    err = nrfx_ppi_channel_alloc(&ppic_cntc0);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_count_timer, NRF_TIMER_CC_CHANNEL0);
    task_addr = nrfx_timer_task_address_get(&m_burst_timer, NRF_TIMER_TASK_STOP);
    err = nrfx_ppi_channel_assign(ppic_cntc0, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    err =nrfx_ppi_channel_enable(ppic_cntc0);
    APP_ERROR_CHECK(err);

    // spi end triggers cs toggle
    err = nrfx_ppi_channel_alloc(&ppic_spi_end);
    APP_ERROR_CHECK(err);

    event_addr = nrf_drv_spi_end_event_get(&m_dac_spi);
    // event_addr = nrfx_timer_compare_event_address_get(&m_burst_timer, NRF_TIMER_CC_CHANNEL2);
    task_addr = nrfx_gpiote_out_task_addr_get(DAC_SPI_SS_PIN);

    err = nrfx_ppi_channel_assign(ppic_spi_end, event_addr, task_addr);
    APP_ERROR_CHECK(err);

//    task_addr = nrfx_timer_task_address_get(&m_count_timer, NRF_TIMER_TASK_COUNT);
//    err = nrfx_ppi_channel_fork_assign(ppic_spi_end, task_addr);
//    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppic_spi_end);
    APP_ERROR_CHECK(err);

    // spi start
    static uint8_t wt[8] = { 0x90, 0x00, 0x90, 0x00, 0x90, 0x00, 0x90, 0x00 }; // set wtm mode

    static nrf_drv_spi_xfer_desc_t xfer = {
        .p_tx_buffer = wt,
        .tx_length = 2
    };

    uint32_t flags =
        NRF_DRV_SPI_FLAG_HOLD_XFER |
        // NRF_DRV_SPI_FLAG_TX_POSTINC |
        NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER |
        NRF_DRV_SPI_FLAG_REPEATED_XFER;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, flags);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_enable(&m_count_timer);
    nrf_drv_timer_enable(&m_burst_timer);
}
#endif

// 100Hz (10 * 1000us) period, 50uS pulse width
// single timer
// init delay 10us
// on event
// off event
static void test20_cycle_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("test20 c0 fired");

            break;
        case NRF_TIMER_EVENT_COMPARE1:
            NRF_LOG_INFO("test20 c1 fired");

            break;
        case NRF_TIMER_EVENT_COMPARE2:
            NRF_LOG_INFO("test20 c2 fired");
            break;
        default:
            break;
    }
}

static void test20_timer_init(void)
{
    uint32_t err_code;
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&m_burst_timer, &timer_cfg, test20_cycle_timer_callback);  // TODO
    APP_ERROR_CHECK(err_code);
}

#ifndef DAC_USE_SPI_MNGR
static void dummy_spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context)
{
    ret_code_t err;
    static uint8_t gh[2] = { 0x6F, 0xF0 };  // set channel g high
    static uint8_t gl[2] = { 0x60, 0x00 };  // set channel g low
    static nrf_drv_spi_xfer_desc_t xfer_gh = { .p_tx_buffer = gh, .tx_length = 2, };
    static nrf_drv_spi_xfer_desc_t xfer_gl = { .p_tx_buffer = gl, .tx_length = 2, };

    dac_spi_ctx_t *p_ctx = (dac_spi_ctx_t *)p_context;

    if (p_ctx->bypass) {
        NRF_LOG_INFO("spi event bypass");
        return;
    }

    if (p_ctx->value == 0)
    {
        err = nrf_drv_spi_xfer(&m_dac_spi, &xfer_gl, NRF_DRV_SPI_FLAG_HOLD_XFER);
        APP_ERROR_CHECK(err);
    }
    else
    {
        err = nrf_drv_spi_xfer(&m_dac_spi, &xfer_gh, NRF_DRV_SPI_FLAG_HOLD_XFER);
        APP_ERROR_CHECK(err);
    }
    p_ctx->value = !p_ctx->value;
}

/**
 * burst timer used in this test, with rise, fall, and rewind compares. Rewind is set to 100Hz.
 * rise triggers spi task to rise g
 * fall triggers spi task to fall g
 * for example:
 * 1 init
 * 2 xfer (hold) high
 * 3 loop timer
 *   rise ppi> spi task -> done interrupt -> code toggle xfer (hold)
 *   fall ppi> spi task -> done interrupt -> code toggle xfer (hold)
 *
 * !!! PROBLEM !!!
 * it is seen that the pulse may be inverted due interrupt overlap or missing.
 * on oscilloscope we can see the spi interface signal, cs and clock (or data), the cs pull down
 * persists almost 60us, which is too high. we try to solve this problem in next test, using PPI to control
 * cs pin, rather than spi driver.
 */
static void test20_run(void)
{
    (void)test20_run;

    nrfx_err_t err;
    nrf_ppi_channel_t ppi_channel_rise;
    nrf_ppi_channel_t ppi_channel_fall;

    static dac_spi_ctx_t ctx = { 0 };

    err = nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, dummy_spi_event_handler, &ctx);
    APP_ERROR_CHECK(err);

    test20_timer_init();

    // rise
    nrf_drv_timer_compare(&m_burst_timer,
                          NRF_TIMER_CC_CHANNEL0,
                          100,
                          false);
    // fall
    nrf_drv_timer_compare(&m_burst_timer,
                          NRF_TIMER_CC_CHANNEL1,
                          160,
                          false);

    // rewind
    nrf_drv_timer_extended_compare(&m_burst_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   10 * 1000,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   false);
    // rise ppi
    err = nrfx_ppi_channel_alloc(&ppi_channel_rise);
    APP_ERROR_CHECK(err);

